{
    "version": "1.0",
    "truncation": null,
    "padding": {
      "strategy": {
        "Fixed": 128
      },
      "direction": "Right",
      "pad_to_multiple_of": null,
      "pad_id": 0,
      "pad_type_id": 0,
      "pad_token": "<pad>"
    },
    "added_tokens": [
      {
        "id": 0,
        "content": "<pad>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 1,
        "content": "<bos>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 2,
        "content": "<eos>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 3,
        "content": ".",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 4,
        "content": "[1*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 5,
        "content": "[2*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 6,
        "content": "[3*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 7,
        "content": "[4*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 8,
        "content": "[5*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 9,
        "content": "[6*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 10,
        "content": "[7*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 11,
        "content": "[8*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 12,
        "content": "[9*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 13,
        "content": "[10*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 14,
        "content": "[11*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 15,
        "content": "[12*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 16,
        "content": "[13*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 17,
        "content": "[14*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 18,
        "content": "[15*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 19,
        "content": "[16*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 20,
        "content": "[17*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 21,
        "content": "[18*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 22,
        "content": "[19*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 23,
        "content": "[20*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 24,
        "content": "[21*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 25,
        "content": "[22*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 26,
        "content": "[23*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 27,
        "content": "[24*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 28,
        "content": "[25*]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 29,
        "content": "c",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 30,
        "content": "[O+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 31,
        "content": "I",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 32,
        "content": "[N+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 33,
        "content": "1",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 34,
        "content": "[As]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 35,
        "content": "[o+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 36,
        "content": "[NH2+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 37,
        "content": "[S+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 38,
        "content": "N",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 39,
        "content": "[O-]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 40,
        "content": "[s+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 41,
        "content": "[Na]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 42,
        "content": "3",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 43,
        "content": "[B-]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 44,
        "content": "s",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 45,
        "content": "O",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 46,
        "content": "P",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 47,
        "content": "[P+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 48,
        "content": "B",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 49,
        "content": "[C+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 50,
        "content": "5",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 51,
        "content": "o",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 52,
        "content": "9",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 53,
        "content": "[Cl+3]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 54,
        "content": "[PH]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 55,
        "content": "[se]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 56,
        "content": "[Si]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 57,
        "content": "[n+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 58,
        "content": "[CH2-]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 59,
        "content": "2",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 60,
        "content": "[N-]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 61,
        "content": "4",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 62,
        "content": "[S-]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 63,
        "content": "[C-]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 64,
        "content": "[SH]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 65,
        "content": ")",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 66,
        "content": "n",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 67,
        "content": "F",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 68,
        "content": "8",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 69,
        "content": "(",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 70,
        "content": "7",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 71,
        "content": "[Se]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 72,
        "content": "[te]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 73,
        "content": "=",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 74,
        "content": "[As+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 75,
        "content": "[NH+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 76,
        "content": "6",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 77,
        "content": "[Te]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 78,
        "content": "C",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 79,
        "content": "S",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 80,
        "content": "-",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 81,
        "content": "[n-]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 82,
        "content": "Br",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 83,
        "content": "#",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 84,
        "content": "%10",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 85,
        "content": "[H]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 86,
        "content": "Cl",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 87,
        "content": "[nH]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 88,
        "content": "[I+]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 89,
        "content": "[Zn+2]",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      }
    ],
    "normalizer": null,
    "pre_tokenizer": {
      "type": "ByteLevel",
      "add_prefix_space": false,
      "trim_offsets": true,
      "use_regex": true
    },
    "post_processor": {
      "type": "TemplateProcessing",
      "single": [
        {
          "SpecialToken": {
            "id": "<bos>",
            "type_id": 0
          }
        },
        {
          "Sequence": {
            "id": "A",
            "type_id": 0
          }
        },
        {
          "SpecialToken": {
            "id": "<eos>",
            "type_id": 0
          }
        }
      ],
      "pair": [
        {
          "Sequence": {
            "id": "A",
            "type_id": 0
          }
        },
        {
          "Sequence": {
            "id": "B",
            "type_id": 1
          }
        }
      ],
      "special_tokens": {
        "<bos>": {
          "id": "<bos>",
          "ids": [
            1
          ],
          "tokens": [
            "<bos>"
          ]
        },
        "<eos>": {
          "id": "<eos>",
          "ids": [
            2
          ],
          "tokens": [
            "<eos>"
          ]
        }
      }
    },
    "decoder": {
      "type": "ByteLevel",
      "add_prefix_space": true,
      "trim_offsets": true,
      "use_regex": true
    },
    "model": {
      "type": "BPE",
      "dropout": null,
      "unk_token": null,
      "continuing_subword_prefix": null,
      "end_of_word_suffix": null,
      "fuse_unk": false,
      "byte_fallback": false,
      "ignore_merges": false,
      "vocab": {},
      "merges": []
    }
  }